//TODO!
/*Coroutines:
/* это ф-ции с одним из следующих ключевых слов:
/* - co_await: приостанавливает корутину и ждет пока другое вычисление(асинхронное?) будет завершено
/* - co_yield: возвращает значение из корутины в вызывающую ф-цию, и приостанавливает корутину, при вызове этой корутины
/* выполнится данный шаг еще раз
/* - co_return - возвращение из корутины
/* Корутины могут быть использованны для:
/* - Генераторов
/* - Асинхронного I/O
/* - Ленивого вычисления
/* - Событийно управляемых приложений
*/